ovelhaaa/voxP4/sdkconfig.defaults
# Reproducible firmware target. Other project settings retain ESP-IDF defaults.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# PSRAM Configuration for ESP32-P4 (32MB HEX PSRAM @ 200MHz)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# CPU Frequency and FreeRTOS
CONFIG_ESP32P4_DEFAULT_CPU_FREQ_360=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Profiling and Operation Mode
CONFIG_VOCAL_FX_ENABLE_PROFILING=y
CONFIG_VOXP4_MODE_I2S_B4B_SYNTHETIC_VOICED=y

# Normal Task Watchdog configuration (retained)
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# Chip Revision support for ESP32-P4 production silicon (rev v1.3)
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199
